
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ТекущаяСтрока") Тогда
		Элементы.Список.ТекущаяСтрока = Параметры.ТекущаяСтрока;
	КонецЕсли;
	
	НеПоказыватьУдаленные = РегистрыСведений.ХранилищеНастроек.ПолучитьНастройку("НеПоказыватьУдаленные", Истина);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = НеПоказыватьУдаленные;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	
	СписокСсылок = Неопределено;
	Параметры.Свойство("Ссылки", СписокСсылок);
	Если СписокСсылок <> Неопределено Тогда
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка");
		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		ЭлементОтбора.Использование = Истина;
		ЭлементОтбора.ПравоеЗначение = СписокСсылок;
	КонецЕсли;
	
	//Сие чудо вставлено для совместимости с новыми версиями моб.платформы, т.к. например в версии 8.3.9.74 1с падает с ошибкой
	#Если МобильноеПриложениеСервер Тогда
		СисИнфо = Новый СистемнаяИнформация;
		Если СисИнфо.ВерсияПриложения <> "8.3.8.58" Тогда
			Элементы.Наименование.МногострочныйРежим = Ложь;
		КонецЕсли;
	#КонецЕсли
КонецПроцедуры
