
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РезультатыТестирования.Очистить();
	Движения.РезультатыТестирования.Записывать = Истина;
	Для Каждого ТекСтрокаОтветы Из Ответы Цикл
		Движение = Движения.РезультатыТестирования.Добавить();
		Движение.Период = Дата;
		Движение.Вопрос = ТекСтрокаОтветы.Вопрос;
		Движение.НомерОтвета = ТекСтрокаОтветы.НомерОтвета;
		
		НайденныйОтвет = ТекСтрокаОтветы.Вопрос.Ответы.Найти(ТекСтрокаОтветы.НомерОтвета);
		Если НайденныйОтвет = Неопределено Тогда
			Движение.Правильный = 0;
		Иначе
			Движение.Правильный = ?(НайденныйОтвет.ЭтоПравильный, 1, 0);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры
