Процедура ЗаписатьНастройку(Настройка, Значение) Экспорт
	Запись = РегистрыСведений.ХранилищеНастроек.СоздатьМенеджерЗаписи();
	Запись.Настройка = Настройка;
	Запись.Значение = Значение;
	Запись.Записать(Истина);
КонецПроцедуры

Функция ПолучитьНастройку(Настройка, ПоУмолчанию = Неопределено) Экспорт
	
	Запись = РегистрыСведений.ХранилищеНастроек.СоздатьМенеджерЗаписи();
	Запись.Настройка = Настройка;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если ТипЗнч(Запись.Значение) = Тип("СправочникСсылка.ВопросыИОтветы") или ТипЗнч(Запись.Значение) = Тип("СправочникСсылка.Разделы") Тогда
			Если НЕ ЗначениеЗаполнено(Запись.Значение.ВерсияДанных) Тогда
				Возврат ПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
		Возврат Запись.Значение;
	КонецЕсли;
	
	ЗаписатьНастройку(Настройка, ПоУмолчанию);
	
	Возврат ПоУмолчанию;
	
КонецФункции