
&НаКлиенте
Процедура ЗагрузитьВопросы(Команда)
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершениеПомещенияФайла", ЭтотОбъект);
	
	НачатьПомещениеФайла(ОповещениеОЗавершении,,,,УникальныйИдентификатор)
КонецПроцедуры

&НаСервере
Процедура ЗавершениеПомещенияФайла(Результат, Адрес, ПомещаемыйФайл, ДополнительныеПараметры)

	Если Результат Тогда
	
		ИмяВремФайла = ПолучитьИмяВременногоФайла();
		
		Данные = ПолучитьИзВременногоХранилища(Адрес);
		Данные.Записать(ИмяВремФайла);
		
		РаботаСФайлами.ЗагрузитьВопросы(ИмяВремФайла);
		
		УдалитьФайлы(ИмяВремФайла);
		
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Вопросы загружены с неизвестным результатом";
		Сообщение.Сообщить(); 
		
	КонецЕсли; 	

КонецПроцедуры

&НаКлиенте
Процедура РезультатСоообщение()

	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Вопросы загружены с неизвестным результатом";
	Сообщение.Сообщить(); 

КонецПроцедуры
 
 
