Функция ВыборФайла(РежимДиалога) Экспорт
	// Создать новый диалог для открытия файлов.
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);

	ДиалогФыбораФайла.МножественныйВыбор=Ложь;

	// Какие типы файлов будут предложены для выбора.
	ДиалогФыбораФайла.Фильтр = "Файл с вопросами (q*.xml)|q*.xml|Все файлы |*.*";

	ДиалогФыбораФайла.Заголовок = "Выберите файл";                                         

	// В диалоге будет открыт предварительный просмотр файлов
	//ДиалогФыбораФайла.ПредварительныйПросмотр = Истина;

	// При открытии диалога сначала для выбора будут предложены файлы
	// первого типа, из типов, перечисленных в свойстве "Фильтр".
	ДиалогФыбораФайла.ИндексФильтра = 0;

	// Открыть диалог выбора файла.
	Если ДиалогФыбораФайла.Выбрать() Тогда

		Возврат ДиалогФыбораФайла.ВыбранныеФайлы[0];
		
		// Действия, выполняемые тогда, когда файл выбран.
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции
