Процедура ДобавитьОтвет(Вопрос, Ответ) Экспорт
	
	НайденныйВопрос = НайтиПоРеквизиту("Вопрос", Вопрос);
	
	Если НайденныйВопрос = ПустаяСсылка() Тогда
	
		НовыйЭлемент = СоздатьЭлемент();
		НовыйЭлемент.Вопрос = Вопрос;
		НовыйЭлемент.Ответ = Ответ;
		НовыйЭлемент.Записать();
	Иначе
		НайденныйВопрос.Ответ = Ответ;
	КонецЕсли;
	
	
	
КонецПроцедуры

Функция ПолучитьОтвет(Вопрос) Экспорт
	НайденныйВопрос = НайтиПоРеквизиту("Вопрос", Вопрос);
	
	Если НайденныйВопрос = ПустаяСсылка() Тогда
	
		Возврат 0;
	Иначе
		Возврат НайденныйВопрос.Ответ;
	КонецЕсли;
	
КонецФункции


Процедура Очистить() Экспорт
	Выборка = Выбрать();
	Пока Выборка.Следующий() Цикл
		Об1 = Выборка.ПолучитьОбъект();
		Об1.Удалить();
	КонецЦикла;
		
КонецПроцедуры

