
&НаКлиенте
Процедура ТестированиеПоРазделам(Команда)
	ОткрытьФорму("Обработка.ТестированиеПоРазделам.Форма.Форма");
	//ТестированиеПоРазделамНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьФормуВопроса(ТекущийВопрос, Ответ, ПоказатьОтвет)
	 ПараметрыФормы = Новый Структура("ТекущийВопрос,ВыбранныйОтвет,ПоказатьОтвет",ТекущийВопрос, Ответ, ПоказатьОтвет);
	 Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВопроса",ЭтотОбъект);
	ОткрытьФорму("Обработка.ФормаВопроса.Форма.Форма",ПараметрыФормы, ЭтаФорма,,,,Оп);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРезультат()
	Сообщение = Новый СообщениеПользователю;
	
	Сообщение.Текст = РаботаСВопросами.РезультатТестирования(); // "Ваш результат превосходен!";
 	Сообщение.Сообщить();
  	РаботаСВопросами.ОчиститьТекущиеВопросы();
	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияФормыВопроса(Результат, ДополнительныеПараметры ) Экспорт
	
	ПоказатьОтвет = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	
	ИначеЕсли Результат.Режим = "Следующий" Тогда
		//ТекущийВопрос = РаботаСВопросами.СледующийВопрос(ТекущийВопрос, Истина);
		ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос();
		Если ТекущийВопрос = Неопределено Тогда
		  	// Показать результат
			ПоказатьРезультат();
		  	Возврат;
		КонецЕсли;
	ИначеЕсли Результат.Режим = "ПоказатьПравильный" Тогда
		ПоказатьОтвет = Истина;
	//ИначеЕсли Результат.Режим = "Предыдущий" Тогда
	//	ТекущийВопрос = РаботаСВопросами.СледующийВопрос(ТекущийВопрос, Ложь);
	//ИначеЕсли Результат.Режим = "Ответить" Тогда
	//	Правильный = РаботаСВопросами.ДобавитьОтвет(ТекущийВопрос, Результат.Ответ);
	//	//ПравильныйОтвет = РаботаСВопросами.ПолучитьПравильныйОтвет(ТекущийВопрос);
	//	Если Правильный Тогда
	//		//Сообщение = Новый СообщениеПользователю;
	//		//Сообщение.Текст = "Правильно!";
	//		//Сообщение.Сообщить();
	//		Сообщить("Правильно!");
	//	Иначе
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Неправильно!";
	//		Сообщение.Сообщить();
	//

	//	КонецЕсли;
		
		//ТекущийВопрос = РаботаСВопросами.СледующийВопрос(ТекущийВопрос, Истина);
	ИначеЕсли Результат.Режим = "Завершить" Тогда
		ПоказатьРезультат();
		Возврат;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Форма вернула неизвестный результат: " + Результат.Режим;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Отв = РаботаСВопросами.ПолучитьОтвет(ТекущийВопрос);
	ПоказатьФормуВопроса(ТекущийВопрос, Отв, ПоказатьОтвет);
	
	
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	НомерРаздела = РегистрыСведений.ХранилищеНастроек.ПолучитьНастройку("ТекущийРаздел", 1);
	ТекущийРаздел = Справочники.Разделы.НайтиПоРеквизиту("НомерРаздела", НомерРаздела);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьРаздел(Раздел)
	РегистрыСведений.ХранилищеНастроек.ЗаписатьНастройку("ТекущийРаздел", Раздел.НомерРаздела);	
КонецПроцедуры


&НаКлиенте
Процедура ТестированиеПоРазделу(Команда)
	//НеОтвеченных = РаботаСВопросами.ЕстьНеОтвеченные 
	Если РаботаСВопросами.ЕстьНеОтвеченные()=0 Тогда
		РаботаСВопросами.ЗаполнитьВопросыТестирования(ТекущийРаздел); // ОчиститьТекущиеВопросы();
		ЗаписатьРаздел(ТекущийРаздел); 
	КонецЕсли;

	ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос(); // КрайнийВопрос(ТекущийРаздел);
	
	Если ТекущийВопрос = Неопределено Тогда
		ПоказатьРезультат();
		Возврат;
	КонецЕсли;
	
	
	
	ПоказатьФормуВопроса(ТекущийВопрос, 0, Ложь)
КонецПроцедуры

&НаКлиенте
Процедура СлучайноеТестированиеПоВсем(Команда)
	Если РаботаСВопросами.ЕстьНеОтвеченные()=0 Тогда
		РаботаСВопросами.ЗаполнитьВопросыТестирования(); 
	КонецЕсли;

	ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос(); 
	
	Если ТекущийВопрос = Неопределено Тогда
		ПоказатьРезультат();
		Возврат;
	КонецЕсли;
	
	ПоказатьФормуВопроса(ТекущийВопрос, 0, Ложь)

КонецПроцедуры
