
&НаКлиенте
Процедура ТестированиеПоРазделам(Команда)
	ОткрытьФорму("Обработка.ТестированиеПоРазделам.Форма.Форма");
	//ТестированиеПоРазделамНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьФормуВопроса(ТекущийВопрос, Ответ, ПоказатьОтвет)
	НеОтвеченных = РаботаСВопросами.ЕстьНеОтвеченные();
	ПараметрыФормы = Новый Структура("ТекущийВопрос,ВыбранныйОтвет,ПоказатьОтвет, НеОтвеченных",ТекущийВопрос, Ответ, ПоказатьОтвет, НеОтвеченных);
	 Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыВопроса",ЭтотОбъект);
	ОткрытьФорму("Обработка.ФормаВопроса.Форма.Форма",ПараметрыФормы, ЭтаФорма,,,,Оп);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьРезультат()
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = РаботаСВопросами.РезультатТестирования(); // "Ваш результат превосходен!";
 	Сообщение.Сообщить();
	
	РаботаСВопросами.ЗаписатьРезультатыТестирования();
	
		
  	РаботаСВопросами.ОчиститьТекущиеВопросы();
	ЗаполнитьВидимость();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПустойВопрос()
	Возврат Справочники.ВопросыИОтветы.ПустаяСсылка();
КонецФункции


&НаКлиенте
Процедура ПослеЗакрытияФормыВопроса(Результат, ДополнительныеПараметры ) Экспорт
	
	ПоказатьОтвет = Ложь;
	
	Если Результат = Неопределено Тогда
		Возврат;
	
	ИначеЕсли Результат.Режим = "Следующий" Тогда
		//ТекущийВопрос = РаботаСВопросами.СледующийВопрос(ТекущийВопрос, Истина);
		ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос();
		Если ТекущийВопрос = ПустойВопрос() Тогда
		  	// Прошли все вопросы
			//Если РежимРаботы = "ПоРазделу" Тогда
			//	ТекущийРаздел = РаботаСВопросами.СледующийРаздел(ТекущийРаздел);
			//	ЗаписатьРаздел(ТекущийРаздел);
			//КонецЕсли;

			ПоказатьРезультат();
		  	Возврат;
		КонецЕсли;
	ИначеЕсли Результат.Режим = "ПоказатьПравильный" Тогда
		ПоказатьОтвет = Истина;
	//ИначеЕсли Результат.Режим = "Предыдущий" Тогда
	//	ТекущийВопрос = РаботаСВопросами.СледующийВопрос(ТекущийВопрос, Ложь);
	//ИначеЕсли Результат.Режим = "Ответить" Тогда
	//	Правильный = РаботаСВопросами.ДобавитьОтвет(ТекущийВопрос, Результат.Ответ);
	//	//ПравильныйОтвет = РаботаСВопросами.ПолучитьПравильныйОтвет(ТекущийВопрос);
	//	Если Правильный Тогда
	//		//Сообщение = Новый СообщениеПользователю;
	//		//Сообщение.Текст = "Правильно!";
	//		//Сообщение.Сообщить();
	//		Сообщить("Правильно!");
	//	Иначе
	//		Сообщение = Новый СообщениеПользователю;
	//		Сообщение.Текст = "Неправильно!";
	//		Сообщение.Сообщить();
	//

	//	КонецЕсли;
		
		//ТекущийВопрос = РаботаСВопросами.СледующийВопрос(ТекущийВопрос, Истина);
	ИначеЕсли Результат.Режим = "Завершить" Тогда
		ПоказатьРезультат();
		Возврат;
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Форма вернула неизвестный результат: " + Результат.Режим;
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Отв = РаботаСВопросами.ПолучитьОтвет(ТекущийВопрос);
	ПоказатьФормуВопроса(ТекущийВопрос, Отв, ПоказатьОтвет);
	
	
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	
	//НомерРаздела = РегистрыСведений.ХранилищеНастроек.ПолучитьНастройку("ТекущийРаздел", 1);
	ТекущийРаздел = РегистрыСведений.ХранилищеНастроек.ПолучитьНастройку("ТестированиеПоРазделам.ТекущийРаздел");
	Если ТекущийРаздел = Неопределено Тогда
		ТекущийРаздел = Справочники.Разделы.ПустаяСсылка();
	КонецЕсли;

	//ТекущийРаздел = Справочники.Разделы.НайтиПоРеквизиту("НомерРаздела", НомерРаздела);
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВидимость()
	Если РаботаСВопросами.ЕстьНеОтвеченные()=0 Тогда
		Элементы.ПродолжитьСлучайноеТестирование.Доступность = Ложь;
		Элементы.ЗавершитьСлучайноеТестирование.Доступность = Ложь;
		Элементы.ТекущийРаздел.Доступность = Истина;
		Элементы.СлучайноеТестированиеПоВсем.Доступность = Истина;
		Элементы.ТестированиеПоРазделу.Доступность = Истина;
	Иначе
		Элементы.ПродолжитьСлучайноеТестирование.Доступность = Истина;
		Элементы.ЗавершитьСлучайноеТестирование.Доступность = Истина;
		Элементы.ТекущийРаздел.Доступность = Ложь;
		Элементы.СлучайноеТестированиеПоВсем.Доступность = Ложь;
		Элементы.ТестированиеПоРазделу.Доступность = Ложь;
	КонецЕсли;	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ЗаписатьРаздел(Раздел)
	РегистрыСведений.ХранилищеНастроек.ЗаписатьНастройку("ТестированиеПоРазделам.ТекущийРаздел", Раздел);	
КонецПроцедуры


&НаКлиенте
Процедура ТестированиеПоРазделу(Команда)
	//НеОтвеченных = РаботаСВопросами.ЕстьНеОтвеченные 
	
	//ТекущийРаздел = РаботаСВопросами.СледующийРаздел(ТекущийРаздел);
	//ВОзврат;
	
	Если РаботаСВопросами.ЕстьНеОтвеченные()=0 Тогда
		РежимРаботы = "ПоРазделу";
		РаботаСВопросами.ЗаполнитьВопросыТестирования(ТекущийРаздел); // ОчиститьТекущиеВопросы();
		ЗаписатьРаздел(ТекущийРаздел); 
	КонецЕсли;

	ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос(); // КрайнийВопрос(ТекущийРаздел);
	
	Если ТекущийВопрос = Неопределено Тогда
		ПоказатьРезультат();
		Возврат;
	КонецЕсли;
	
	ЗаполнитьВидимость();
	
	ПоказатьФормуВопроса(ТекущийВопрос, 0, Ложь)
КонецПроцедуры

&НаКлиенте
Процедура СлучайноеТестированиеПоВсем(Команда)
	Если РаботаСВопросами.ЕстьНеОтвеченные()=0 Тогда
		РаботаСВопросами.ЗаполнитьВопросыТестирования(); 
		РежимРаботы = "ПоВсем";
	КонецЕсли;

	ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос(); 
	
	Если ТекущийВопрос = Неопределено Тогда
		ПоказатьРезультат();
		Возврат;
	КонецЕсли;
	ЗаполнитьВидимость();
	ПоказатьФормуВопроса(ТекущийВопрос, 0, Ложь)

КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьСлучайноеТестирование(Команда)
	Если РаботаСВопросами.ЕстьНеОтвеченные()> 0 Тогда
		ТекущийВопрос = РаботаСВопросами.СлучайныйВопрос(); 
	
		Если ТекущийВопрос = Неопределено Тогда
			ПоказатьРезультат();
			Возврат;
		КонецЕсли;
		
		ПоказатьФормуВопроса(ТекущийВопрос, 0, Ложь)
 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСлучайноеТестирование(Команда)
	Если Вопрос("Завершить тестирование?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		ПоказатьРезультат();

	КонецЕсли;

	КонецПроцедуры
