
&НаСервереБезКонтекста
Процедура КомандаВыгрузитьНаСервере(ПутьКФайлу)
	РегистрыСведений.ХранилищеНастроек.ЗаписатьНастройку("ПутьКФайлуВыгрузки", ПутьКФайлу) ;
	
	РаботаСФайлами.ВыгрузитьВопросыВФайл(ПутьКФайлу);
	
	Сообщить("Выгружено! Файл "+ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыгрузить(Команда)
	КомандаВыгрузитьНаСервере(ПутьКФайлу);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПутьКФайлу = РегистрыСведений.ХранилищеНастроек.ПолучитьНастройку("ПутьКФайлуВыгрузки", "")
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбранноеИмяФайла = ИнтерфейсныеФункции.ВыборФайла(РежимДиалогаВыбораФайла.Сохранение);
	
	Если НЕ ПустаяСтрока(ВыбранноеИмяФайла) Тогда

		ПутьКФайлу = ВыбранноеИмяФайла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьМодальноНаСервере()
	ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
	РаботаСФайлами.ВыгрузитьВопросыВXML(ИмяВремФайла);
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВремФайла), УникальныйИдентификатор);
	
	УдалитьФайлы(ИмяВремФайла);
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьМодально(Команда)
	
	АдресХранилища = ВыгрузитьМодальноНаСервере();
	
	ОкончаниеПолучения = Новый ОписаниеОповещения("ОкончаниеПолучения", ЭтотОбъект);
	
	ИмяФайлаНаКлиенте = "q_.xml";
	
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяФайлаНаКлиенте, АдресХранилища));
	
	НачатьПолучениеФайлов(ОкончаниеПолучения, ПолучаемыеФайлы,,);
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеПолучения(ПолученныеФайлы, ДополнительныеПараметры) Экспорт

	// Что тут делать неясно	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Что-то выгрузили в файл q_.xml";
	Сообщение.Сообщить(); 
КонецПроцедуры
 
