
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы;
	пРезультатТестирования = Параметры.Найти("РезультатТестирования");
	Если пРезультатТестирования <> Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(пРезультатТестирования.Значение) Тогда
			пРезультатТестирования.Значение = РезультатТестирования;
			пРезультатТестирования.Использование = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
